{
  "_name_or_path": "sdadas/polish-roberta-large-v2",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "B-nam_adj",
    "1": "B-nam_adj_city",
    "2": "B-nam_adj_country",
    "3": "B-nam_adj_person",
    "4": "B-nam_eve",
    "5": "B-nam_eve_human",
    "6": "B-nam_eve_human_cultural",
    "7": "B-nam_eve_human_holiday",
    "8": "B-nam_eve_human_sport",
    "9": "B-nam_fac_bridge",
    "10": "B-nam_fac_goe",
    "11": "B-nam_fac_goe_stop",
    "12": "B-nam_fac_park",
    "13": "B-nam_fac_road",
    "14": "B-nam_fac_square",
    "15": "B-nam_fac_system",
    "16": "B-nam_liv_animal",
    "17": "B-nam_liv_character",
    "18": "B-nam_liv_god",
    "19": "B-nam_liv_habitant",
    "20": "B-nam_liv_person",
    "21": "B-nam_loc",
    "22": "B-nam_loc_astronomical",
    "23": "B-nam_loc_country_region",
    "24": "B-nam_loc_gpe_admin1",
    "25": "B-nam_loc_gpe_admin2",
    "26": "B-nam_loc_gpe_admin3",
    "27": "B-nam_loc_gpe_city",
    "28": "B-nam_loc_gpe_conurbation",
    "29": "B-nam_loc_gpe_country",
    "30": "B-nam_loc_gpe_district",
    "31": "B-nam_loc_gpe_subdivision",
    "32": "B-nam_loc_historical_region",
    "33": "B-nam_loc_hydronym",
    "34": "B-nam_loc_hydronym_lake",
    "35": "B-nam_loc_hydronym_ocean",
    "36": "B-nam_loc_hydronym_river",
    "37": "B-nam_loc_hydronym_sea",
    "38": "B-nam_loc_land",
    "39": "B-nam_loc_land_continent",
    "40": "B-nam_loc_land_island",
    "41": "B-nam_loc_land_mountain",
    "42": "B-nam_loc_land_peak",
    "43": "B-nam_loc_land_region",
    "44": "B-nam_num_house",
    "45": "B-nam_num_phone",
    "46": "B-nam_org_company",
    "47": "B-nam_org_group",
    "48": "B-nam_org_group_band",
    "49": "B-nam_org_group_team",
    "50": "B-nam_org_institution",
    "51": "B-nam_org_nation",
    "52": "B-nam_org_organization",
    "53": "B-nam_org_organization_sub",
    "54": "B-nam_org_political_party",
    "55": "B-nam_oth",
    "56": "B-nam_oth_currency",
    "57": "B-nam_oth_data_format",
    "58": "B-nam_oth_license",
    "59": "B-nam_oth_position",
    "60": "B-nam_oth_tech",
    "61": "B-nam_oth_www",
    "62": "B-nam_pro",
    "63": "B-nam_pro_award",
    "64": "B-nam_pro_brand",
    "65": "B-nam_pro_media",
    "66": "B-nam_pro_media_periodic",
    "67": "B-nam_pro_media_radio",
    "68": "B-nam_pro_media_tv",
    "69": "B-nam_pro_media_web",
    "70": "B-nam_pro_model_car",
    "71": "B-nam_pro_software",
    "72": "B-nam_pro_software_game",
    "73": "B-nam_pro_title",
    "74": "B-nam_pro_title_album",
    "75": "B-nam_pro_title_article",
    "76": "B-nam_pro_title_book",
    "77": "B-nam_pro_title_document",
    "78": "B-nam_pro_title_song",
    "79": "B-nam_pro_title_treaty",
    "80": "B-nam_pro_title_tv",
    "81": "B-nam_pro_vehicle",
    "82": "I-nam_adj_country",
    "83": "I-nam_eve",
    "84": "I-nam_eve_human",
    "85": "I-nam_eve_human_cultural",
    "86": "I-nam_eve_human_holiday",
    "87": "I-nam_eve_human_sport",
    "88": "I-nam_fac_bridge",
    "89": "I-nam_fac_goe",
    "90": "I-nam_fac_goe_stop",
    "91": "I-nam_fac_park",
    "92": "I-nam_fac_road",
    "93": "I-nam_fac_square",
    "94": "I-nam_fac_system",
    "95": "I-nam_liv_animal",
    "96": "I-nam_liv_character",
    "97": "I-nam_liv_god",
    "98": "I-nam_liv_person",
    "99": "I-nam_loc",
    "100": "I-nam_loc_astronomical",
    "101": "I-nam_loc_country_region",
    "102": "I-nam_loc_gpe_admin1",
    "103": "I-nam_loc_gpe_admin2",
    "104": "I-nam_loc_gpe_admin3",
    "105": "I-nam_loc_gpe_city",
    "106": "I-nam_loc_gpe_conurbation",
    "107": "I-nam_loc_gpe_country",
    "108": "I-nam_loc_gpe_district",
    "109": "I-nam_loc_gpe_subdivision",
    "110": "I-nam_loc_historical_region",
    "111": "I-nam_loc_hydronym",
    "112": "I-nam_loc_hydronym_lake",
    "113": "I-nam_loc_hydronym_ocean",
    "114": "I-nam_loc_hydronym_river",
    "115": "I-nam_loc_hydronym_sea",
    "116": "I-nam_loc_land",
    "117": "I-nam_loc_land_continent",
    "118": "I-nam_loc_land_island",
    "119": "I-nam_loc_land_mountain",
    "120": "I-nam_loc_land_peak",
    "121": "I-nam_loc_land_region",
    "122": "I-nam_num_house",
    "123": "I-nam_num_phone",
    "124": "I-nam_org_company",
    "125": "I-nam_org_group",
    "126": "I-nam_org_group_band",
    "127": "I-nam_org_group_team",
    "128": "I-nam_org_institution",
    "129": "I-nam_org_nation",
    "130": "I-nam_org_organization",
    "131": "I-nam_org_organization_sub",
    "132": "I-nam_org_political_party",
    "133": "I-nam_oth",
    "134": "I-nam_oth_currency",
    "135": "I-nam_oth_data_format",
    "136": "I-nam_oth_license",
    "137": "I-nam_oth_position",
    "138": "I-nam_oth_tech",
    "139": "I-nam_oth_www",
    "140": "I-nam_pro",
    "141": "I-nam_pro_award",
    "142": "I-nam_pro_brand",
    "143": "I-nam_pro_media",
    "144": "I-nam_pro_media_periodic",
    "145": "I-nam_pro_media_radio",
    "146": "I-nam_pro_media_tv",
    "147": "I-nam_pro_media_web",
    "148": "I-nam_pro_model_car",
    "149": "I-nam_pro_software",
    "150": "I-nam_pro_software_game",
    "151": "I-nam_pro_title",
    "152": "I-nam_pro_title_album",
    "153": "I-nam_pro_title_article",
    "154": "I-nam_pro_title_book",
    "155": "I-nam_pro_title_document",
    "156": "I-nam_pro_title_song",
    "157": "I-nam_pro_title_treaty",
    "158": "I-nam_pro_title_tv",
    "159": "I-nam_pro_vehicle",
    "160": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-nam_adj": 0,
    "B-nam_adj_city": 1,
    "B-nam_adj_country": 2,
    "B-nam_adj_person": 3,
    "B-nam_eve": 4,
    "B-nam_eve_human": 5,
    "B-nam_eve_human_cultural": 6,
    "B-nam_eve_human_holiday": 7,
    "B-nam_eve_human_sport": 8,
    "B-nam_fac_bridge": 9,
    "B-nam_fac_goe": 10,
    "B-nam_fac_goe_stop": 11,
    "B-nam_fac_park": 12,
    "B-nam_fac_road": 13,
    "B-nam_fac_square": 14,
    "B-nam_fac_system": 15,
    "B-nam_liv_animal": 16,
    "B-nam_liv_character": 17,
    "B-nam_liv_god": 18,
    "B-nam_liv_habitant": 19,
    "B-nam_liv_person": 20,
    "B-nam_loc": 21,
    "B-nam_loc_astronomical": 22,
    "B-nam_loc_country_region": 23,
    "B-nam_loc_gpe_admin1": 24,
    "B-nam_loc_gpe_admin2": 25,
    "B-nam_loc_gpe_admin3": 26,
    "B-nam_loc_gpe_city": 27,
    "B-nam_loc_gpe_conurbation": 28,
    "B-nam_loc_gpe_country": 29,
    "B-nam_loc_gpe_district": 30,
    "B-nam_loc_gpe_subdivision": 31,
    "B-nam_loc_historical_region": 32,
    "B-nam_loc_hydronym": 33,
    "B-nam_loc_hydronym_lake": 34,
    "B-nam_loc_hydronym_ocean": 35,
    "B-nam_loc_hydronym_river": 36,
    "B-nam_loc_hydronym_sea": 37,
    "B-nam_loc_land": 38,
    "B-nam_loc_land_continent": 39,
    "B-nam_loc_land_island": 40,
    "B-nam_loc_land_mountain": 41,
    "B-nam_loc_land_peak": 42,
    "B-nam_loc_land_region": 43,
    "B-nam_num_house": 44,
    "B-nam_num_phone": 45,
    "B-nam_org_company": 46,
    "B-nam_org_group": 47,
    "B-nam_org_group_band": 48,
    "B-nam_org_group_team": 49,
    "B-nam_org_institution": 50,
    "B-nam_org_nation": 51,
    "B-nam_org_organization": 52,
    "B-nam_org_organization_sub": 53,
    "B-nam_org_political_party": 54,
    "B-nam_oth": 55,
    "B-nam_oth_currency": 56,
    "B-nam_oth_data_format": 57,
    "B-nam_oth_license": 58,
    "B-nam_oth_position": 59,
    "B-nam_oth_tech": 60,
    "B-nam_oth_www": 61,
    "B-nam_pro": 62,
    "B-nam_pro_award": 63,
    "B-nam_pro_brand": 64,
    "B-nam_pro_media": 65,
    "B-nam_pro_media_periodic": 66,
    "B-nam_pro_media_radio": 67,
    "B-nam_pro_media_tv": 68,
    "B-nam_pro_media_web": 69,
    "B-nam_pro_model_car": 70,
    "B-nam_pro_software": 71,
    "B-nam_pro_software_game": 72,
    "B-nam_pro_title": 73,
    "B-nam_pro_title_album": 74,
    "B-nam_pro_title_article": 75,
    "B-nam_pro_title_book": 76,
    "B-nam_pro_title_document": 77,
    "B-nam_pro_title_song": 78,
    "B-nam_pro_title_treaty": 79,
    "B-nam_pro_title_tv": 80,
    "B-nam_pro_vehicle": 81,
    "I-nam_adj_country": 82,
    "I-nam_eve": 83,
    "I-nam_eve_human": 84,
    "I-nam_eve_human_cultural": 85,
    "I-nam_eve_human_holiday": 86,
    "I-nam_eve_human_sport": 87,
    "I-nam_fac_bridge": 88,
    "I-nam_fac_goe": 89,
    "I-nam_fac_goe_stop": 90,
    "I-nam_fac_park": 91,
    "I-nam_fac_road": 92,
    "I-nam_fac_square": 93,
    "I-nam_fac_system": 94,
    "I-nam_liv_animal": 95,
    "I-nam_liv_character": 96,
    "I-nam_liv_god": 97,
    "I-nam_liv_person": 98,
    "I-nam_loc": 99,
    "I-nam_loc_astronomical": 100,
    "I-nam_loc_country_region": 101,
    "I-nam_loc_gpe_admin1": 102,
    "I-nam_loc_gpe_admin2": 103,
    "I-nam_loc_gpe_admin3": 104,
    "I-nam_loc_gpe_city": 105,
    "I-nam_loc_gpe_conurbation": 106,
    "I-nam_loc_gpe_country": 107,
    "I-nam_loc_gpe_district": 108,
    "I-nam_loc_gpe_subdivision": 109,
    "I-nam_loc_historical_region": 110,
    "I-nam_loc_hydronym": 111,
    "I-nam_loc_hydronym_lake": 112,
    "I-nam_loc_hydronym_ocean": 113,
    "I-nam_loc_hydronym_river": 114,
    "I-nam_loc_hydronym_sea": 115,
    "I-nam_loc_land": 116,
    "I-nam_loc_land_continent": 117,
    "I-nam_loc_land_island": 118,
    "I-nam_loc_land_mountain": 119,
    "I-nam_loc_land_peak": 120,
    "I-nam_loc_land_region": 121,
    "I-nam_num_house": 122,
    "I-nam_num_phone": 123,
    "I-nam_org_company": 124,
    "I-nam_org_group": 125,
    "I-nam_org_group_band": 126,
    "I-nam_org_group_team": 127,
    "I-nam_org_institution": 128,
    "I-nam_org_nation": 129,
    "I-nam_org_organization": 130,
    "I-nam_org_organization_sub": 131,
    "I-nam_org_political_party": 132,
    "I-nam_oth": 133,
    "I-nam_oth_currency": 134,
    "I-nam_oth_data_format": 135,
    "I-nam_oth_license": 136,
    "I-nam_oth_position": 137,
    "I-nam_oth_tech": 138,
    "I-nam_oth_www": 139,
    "I-nam_pro": 140,
    "I-nam_pro_award": 141,
    "I-nam_pro_brand": 142,
    "I-nam_pro_media": 143,
    "I-nam_pro_media_periodic": 144,
    "I-nam_pro_media_radio": 145,
    "I-nam_pro_media_tv": 146,
    "I-nam_pro_media_web": 147,
    "I-nam_pro_model_car": 148,
    "I-nam_pro_software": 149,
    "I-nam_pro_software_game": 150,
    "I-nam_pro_title": 151,
    "I-nam_pro_title_album": 152,
    "I-nam_pro_title_article": 153,
    "I-nam_pro_title_book": 154,
    "I-nam_pro_title_document": 155,
    "I-nam_pro_title_song": 156,
    "I-nam_pro_title_treaty": 157,
    "I-nam_pro_title_tv": 158,
    "I-nam_pro_vehicle": 159,
    "O": 160
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.24.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 128001
}
